andyshinn/nRF54_Arduino/libraries/Bluefruit54Lib/src/bluefruit.cpp
    default: break;
  }

  Advertising._eventHandler(evt);
  Scanner._eventHandler(evt);

  /*------------- BLE Peripheral Events -------------*/
  /* Only handle Peripheral events with matched connection handle
   * or a few special one
   * - Connected event
   * - Advertising timeout (could be connected and advertising at the same time)
   */
  if ( conn_hdl       == _conn_hdl             ||
       evt->header.evt_id == BLE_GAP_EVT_CONNECTED)
  {
    switch ( evt->header.evt_id  )
    {
      case BLE_GAP_EVT_CONNECTED:
      {
        ble_gap_evt_connected_t* para = &evt->evt.gap_evt.params.connected;

        if (para->role == BLE_GAP_ROLE_PERIPH)
        {
          _conn_hdl = evt->evt.gap_evt.conn_handle;
        }
      }
      break;

      case BLE_GAP_EVT_DISCONNECTED:
        _conn_hdl = BLE_CONN_HANDLE_INVALID;
      break;

      default: break;
    }
  }

  // Periph event handler (also handle generic non-connection event)
  if ( (conn == NULL) || (conn->getRole() == BLE_GAP_ROLE_PERIPH) )
  {
    Periph._eventHandler(evt);
  }

  // Central Event Handler (also handle generic non-connection event)
  if ( (conn == NULL) || (conn->getRole() == BLE_GAP_ROLE_CENTRAL) )
  {
    Central._eventHandler(evt);
  }

  // Discovery Event Handler
  if ( Discovery.begun() ) Discovery._eventHandler(evt);

  // GATTs characteristics event handler
  Gatt._eventHandler(evt);

  // User callback if set
  if (_event_cb) _event_cb(evt);
}

/*------------------------------------------------------------------*/
/* Internal Connection LED
 *------------------------------------------------------------------*/
void AdafruitBluefruit::_startConnLed(void)
{
  if (_led_conn) xTimerStart(_led_blink_th, 0);
}

void AdafruitBluefruit::_stopConnLed(void)
{
  xTimerStop(_led_blink_th, 0);

  _setConnLed( this->connected() );
}

void AdafruitBluefruit::_setConnLed (bool on_off)
{
  if (_led_conn)
  {
#ifdef LED_BLUE
    digitalWrite(LED_BLUE, on_off ? LED_STATE_ON : (1-LED_STATE_ON) );
#endif
  }
}

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+

void Bluefruit_printInfo(void)
{
  Bluefruit.printInfo();
}

void AdafruitBluefruit::printInfo(void)
{
  // Skip if Serial is not initialized
  if ( !Serial ) return;
  // prepare for ability to change output, based on compile-time flags
  Print& logger = Serial;

  // Skip if Bluefruit.begin() is not called
  if ( _ble_event_sem == NULL ) return;

  logger.println("--------- SoftDevice Config ---------");

  char const * title_fmt = "%-16s: ";

  /*------------- SoftDevice Config -------------*/
  // Max uuid128
  logger.printf(title_fmt, "Max UUID128");
  logger.println(_sd_cfg.uuid128_max);

  // ATTR Table Size
  logger.printf(title_fmt, "ATTR Table Size");
  logger.println(_sd_cfg.attr_table_size);

  // Service Changed
  logger.printf(title_fmt, "Service Changed");
  logger.println(_sd_cfg.service_changed);

  if ( _prph_count )
  {
    logger.println("Peripheral Connect Setting");

    logger.print("  - ");
    logger.printf(title_fmt, "Max MTU");
    logger.println(_sd_cfg.prph.mtu_max);

    logger.print("  - ");
    logger.printf(title_fmt, "Event Length");
    logger.println(_sd_cfg.prph.event_len);

    logger.print("  - ");
    logger.printf(title_fmt, "HVN Queue Size");
    logger.println(_sd_cfg.prph.hvn_qsize);

    logger.print("  - ");
    logger.printf(title_fmt, "WrCmd Queue Size");
    logger.println(_sd_cfg.prph.wrcmd_qsize);
  }

  if ( _central_count )
  {
    logger.println("Central Connect Setting");

    logger.print("  - ");
    logger.printf(title_fmt, "Max MTU");
    logger.println(_sd_cfg.central.mtu_max);

    logger.print("  - ");
    logger.printf(title_fmt, "Event Length");
    logger.println(_sd_cfg.central.event_len);

    logger.print("  - ");
    logger.printf(title_fmt, "HVN Queue Size");
    logger.println(_sd_cfg.central.hvn_qsize);

    logger.print("  - ");
    logger.printf(title_fmt, "WrCmd Queue Size");
    logger.println(_sd_cfg.central.wrcmd_qsize);
  }

  /*------------- Settings -------------*/
  logger.println("\n--------- BLE Settings ---------");
  // Name
  logger.printf(title_fmt, "Name");
  {
    char name[32];
    memclr(name, sizeof(name));
    getName(name, sizeof(name));
    logger.printf(name);
  }
  logger.println();

  // Max Connections
  logger.printf(title_fmt, "Max Connections");
  logger.printf("Peripheral = %d, ", _prph_count);
  logger.printf("Central = %d ", _central_count);
  logger.println();

  // Address
  logger.printf(title_fmt, "Address");
  {
    char const * type_str[] = { "Public", "Static", "Private Resolvable", "Private Non Resolvable" };
    ble_gap_addr_t gap_addr = this->getAddr();

    // MAC is in little endian --> print reverse
    logger.printBufferReverse(gap_addr.addr, 6, ':');
    logger.printf(" (%s)", type_str[gap_addr.addr_type]);
  }
  logger.println();

  // Tx Power
  logger.printf(title_fmt, "TX Power");
  logger.printf("%d dBm", _tx_power);
  logger.println();

  Periph.printInfo();

  /*------------- List the paired devices -------------*/
  if ( _prph_count )
  {
    logger.printf(title_fmt, "Peripheral Paired Devices");
    logger.println();
    bond_print_list(BLE_GAP_ROLE_PERIPH);
  }

  if ( _central_count )
  {
    logger.printf(title_fmt, "Central Paired Devices");
    logger.println();
    bond_print_list(BLE_GAP_ROLE_CENTRAL);
  }

  logger.println();
}
